# SelectionIncludesOptionItems Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..SelectionIncludesOptionItems Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
Elements that were already in a Design Option were selected. These will not be added to the Option Set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SelectionIncludesOptionItems { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SelectionIncludesOptionItems As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SelectionIncludesOptionItems {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace